# DesignMemberApi

| Method  | Description |
|--------|-------------|
| **Members** | Get members |

<a id="members"></a>
## **Members**
> **List&lt;RcsCheckMember&gt; Members (Guid projectId)**

Get members

### Parameters

| Name | Type | Description | Notes |
|------|------|-------------|-------|
| **projectId** | **Guid** |  |  |

### Return type

**List&lt;RcsCheckMember&gt;**

### Example

Note: this example is autogenerated.

```csharp
using System;
using System.Collections.Generic;
using System.Diagnostics;
using IdeaStatiCa.RcsApi.Api;
using IdeaStatiCa.RcsApi.Client;
using IdeaStatiCa.RcsApi.Model;

namespace Example
{
    public class MembersExample
    {
        public static void Main()
        {
            // Create the client which is connected to the service.
            ConnectionApiClientFactory clientFactory = new ConnectionApiClientFactory("http://localhost:5000");
            using (var conClient = await clientFactory.CreateConnectionApiClient())
            {

                try
                {
                    // Get members
                    List<RcsCheckMember> result = conClient.DesignMember.Members(projectId);
                    Debug.WriteLine(result);
                }
                catch (ApiException  e)
                {
                    Console.WriteLine("Exception when calling DesignMember.Members: " + e.Message);
                    Console.WriteLine("Status Code: " + e.ErrorCode);
                    Console.WriteLine(e.StackTrace);
                }
                finally
                {
                }
            }
        }
    }
}
```

### Code Samples

[!code-csharp]

Looking for a code sample? request some help on our discussion page.

### REST Usage

#### Http Request

All URIs are relative to *http://localhost*

> **GET** /api/1/projects/{projectId}/design-members

#### Using the MembersWithHttpInfo variant
This returns an ApiResponse object which contains the response data, status code and headers.

```csharp
try
{
    // Get members
    ApiResponse<List<RcsCheckMember>> response = conClient.DesignMember.MembersWithHttpInfo(projectId);
    Debug.Write("Status Code: " + response.StatusCode);
    Debug.Write("Response Headers: " + response.Headers);
    Debug.Write("Response Body: " + response.Data);
}
catch (ApiException e)
{
    Debug.Print("Exception when calling DesignMemberApi.MembersWithHttpInfo: " + e.Message);
    Debug.Print("Status Code: " + e.ErrorCode);
    Debug.Print(e.StackTrace);
}
```

#### Authorization

No authorization required

#### HTTP request headers

 - **Content-Type**: Not defined
 - **Accept**: application/json

#### HTTP response details
| Status code | Description | Response headers |
|-------------|-------------|------------------|
| **200** | Success |  -  |

[[Back to top]](#) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to Model list]](../README.md#documentation-for-models) [[Back to README]](../README.md)